kernel/process/process.org
#+TITLE: 进程
#+AUTHOR: Cauchy(pqy7172@gmail.com)
#+EMAIL: pqy7172@gmail.com
#+HTML_HEAD: <link rel="stylesheet" href="../../org-manual.css" type="text/css">

对任何多程序操作系统来说，进程的概念都是很基本的．进程通常定义为一个程序的执行实例．因此，如果有16个用户运行vi，就会有16个不同的进程(尽管它们可以共享相同的可执行代码)．在Linux的源代码里，进程通常叫做任务或线程．

在本文中，讨论进程的属性，内核是怎样执行进程切换的．最后介绍进程是如何创建以及销毁的．

* 进程和轻量级进程
进程可能有几个不同的意义．在本文里，采用OS教材一般的定义：进程是在执行中的实例．

进程有点像人类，进程产生出来，它们或有重要意义或没有多少意义的人生．它们可能会产生一个或多个子进程，并且最终会死亡．一个小的不同是进程没有性别，每个进程仅有一个父亲．

从内核的角度来说，进程是作为一个实体，可以分配系统资源(包括CPU时间，内存等)．
* 进程描述符
* 进程切换
* 创建进程
* 销毁进程
