kernel/process/process.html
<!DOCTYPE html>
<html lang="cn">
<head>
<!-- 2021-11-08 Mon 23:34 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>进程</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Cauchy(pqy7172@gmail.com)">
<link rel="stylesheet" href="../../org-manual.css" type="text/css">
</head>
<body>
<div id="content">
<h1 class="title">进程</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org11e289e">1. 进程和轻量级进程</a></li>
<li><a href="#orge9a6040">2. 进程描述符</a></li>
<li><a href="#orge4a47ae">3. 进程切换</a></li>
<li><a href="#orgc58b99d">4. 创建进程</a></li>
<li><a href="#orge094cc5">5. 销毁进程</a></li>
</ul>
</div>
</div>
<p>
对任何多程序操作系统来说，进程的概念都是很基本的．进程通常定义为一个程序的执行实例．因此，如果有16个用户运行vi，就会有16个不同的进程(尽管它们可以共享相同的可执行代码)．在Linux的源代码里，进程通常叫做任务或线程．
</p>

<p>
在本文中，讨论进程的属性，内核是怎样执行进程切换的．最后介绍进程是如何创建以及销毁的．
</p>

<div id="outline-container-org11e289e" class="outline-2">
<h2 id="org11e289e"><span class="section-number-2">1</span> 进程和轻量级进程</h2>
<div class="outline-text-2" id="text-1">
<p>
进程可能有几个不同的意义．在本文里，采用OS教材一般的定义：进程是在执行中的实例．
</p>

<p>
进程有点像人类，进程产生出来，它们或有重要意义或没有多少意义的人生．它们可能会产生一个或多个子进程，并且最终会死亡．一个小的不同是进程没有性别，每个进程仅有一个父亲．
</p>

<p>
从内核的角度来说，进程是作为一个实体，可以分配系统资源(包括CPU时间，内存等)．
</p>
</div>
</div>
<div id="outline-container-orge9a6040" class="outline-2">
<h2 id="orge9a6040"><span class="section-number-2">2</span> 进程描述符</h2>
</div>
<div id="outline-container-orge4a47ae" class="outline-2">
<h2 id="orge4a47ae"><span class="section-number-2">3</span> 进程切换</h2>
</div>
<div id="outline-container-orgc58b99d" class="outline-2">
<h2 id="orgc58b99d"><span class="section-number-2">4</span> 创建进程</h2>
</div>
<div id="outline-container-orge094cc5" class="outline-2">
<h2 id="orge094cc5"><span class="section-number-2">5</span> 销毁进程</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Cauchy(pqy7172@gmail.com)</p>
<p class="date">Created: 2021-11-08 Mon 23:34</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
